---
kind: method
id: M:Autodesk.Revit.DB.LinePattern.GetSegments
source: html/45d93bfd-5217-a420-01a3-e493bcf6356b.htm
---
# Autodesk.Revit.DB.LinePattern.GetSegments Method

Gets the sequence of segments that defines this line pattern.

## Syntax (C#)
```csharp
public IList<LinePatternSegment> GetSegments()
```

## Returns
The sequence of segments.